src/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослевузовскоеОбразование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПослевузовскоеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УченаяСтепень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УченаяСтепень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименовниеУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФакультетИлиОтделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончанияИлиУхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсПриОкончанииИлиУходе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокМестРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцИГодПоступления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцИГодУхода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Заявка/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Гражданство = ДанныеЗаполнения.Гражданство;
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		ЖелаемаяДолжность = ДанныеЗаполнения.ЖелаемаяДолжность;
		ОСебе = ДанныеЗаполнения.ОСебе;
		Пол = ДанныеЗаполнения.Пол;
		ПолноеИмя = ДанныеЗаполнения.ПолноеИмя;
		ПослевузовскоеОбразование = ДанныеЗаполнения.ПослевузовскоеОбразование;
		СогласиеНаОбработкуПД = ДанныеЗаполнения.СогласиеНаОбработкуПД;
		Стаж = ДанныеЗаполнения.Стаж;
		УченаяСтепень = ДанныеЗаполнения.УченаяСтепень;
		Для Каждого ТекСтрокаОбразование Из ДанныеЗаполнения.Образование Цикл
			НоваяСтрока = Образование.Добавить();
			НоваяСтрока.АдресУЗ = ТекСтрокаОбразование.АдресУЗ;
			НоваяСтрока.ГодОкончанияИлиУхода = ТекСтрокаОбразование.ГодОкончанияИлиУхода;
			НоваяСтрока.ГодПоступления = ТекСтрокаОбразование.ГодПоступления;
			НоваяСтрока.КурсПриОкончанииИлиУходе = ТекСтрокаОбразование.КурсПриОкончанииИлиУходе;
			НоваяСтрока.НаименовниеУЗ = ТекСтрокаОбразование.НаименовниеУЗ;
			НоваяСтрока.НомерДипломаУдостоверения = ТекСтрокаОбразование.НомерДипломаУдостоверения;
			НоваяСтрока.СерияДипломаУдостоверения = ТекСтрокаОбразование.СерияДипломаУдостоверения;
			НоваяСтрока.Специальность = ТекСтрокаОбразование.Специальность;
			НоваяСтрока.ФакультетИлиОтделение = ТекСтрокаОбразование.ФакультетИлиОтделение;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокМестРаботы Из ДанныеЗаполнения.СписокМестРаботы Цикл
			НоваяСтрока = СписокМестРаботы.Добавить();
			НоваяСтрока.АдресОрганизации = ТекСтрокаСписокМестРаботы.АдресОрганизации;
			НоваяСтрока.Должность = ТекСтрокаСписокМестРаботы.Должность;
			НоваяСтрока.МесяцИГодПоступления = ТекСтрокаСписокМестРаботы.МесяцИГодПоступления;
			НоваяСтрока.МесяцИГодУхода = ТекСтрокаСписокМестРаботы.МесяцИГодУхода;
			НоваяСтрока.НаименованиеОрганизации = ТекСтрокаСписокМестРаботы.НаименованиеОрганизации;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
